## Staging: iam
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                 |
|--------|----------------------------------------------------------------------|
| add    | `aws_iam_policy.feedback_viewer_ssm_policy`                          |
|        | `aws_iam_role.feedback_viewer_ecs_role`                              |
|        | `aws_iam_role_policy_attachment.feedback_viewer_ecs_policy`          |
|        | `aws_iam_role_policy_attachment.feedback_viewer_ecs_role_ssm_policy` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.feedback_viewer_ssm_policy will be created
  + resource "aws_iam_policy" "feedback_viewer_ssm_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for feedback-viewer staging to access SSM parameters"
      + id               = (known after apply)
      + name             = "feedback-viewer-ssm-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParametersByPath",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:ca-central-1:992382783569:parameter/feedback-cronjob/staging/docdb-username",
                          + "arn:aws:ssm:ca-central-1:992382783569:parameter/feedback-cronjob/staging/docdb-password",
                          + "",
                        ]
                      + Sid      = "AllowSSMParameterAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "feedback-viewer-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "feedback-viewer-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.feedback_viewer_ecs_role will be created
  + resource "aws_iam_role" "feedback_viewer_ecs_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "feedback-viewer-ecs-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "feedback-viewer-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.feedback_viewer_ecs_policy will be created
  + resource "aws_iam_role_policy_attachment" "feedback_viewer_ecs_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "feedback-viewer-ecs-role"
    }

  # aws_iam_role_policy_attachment.feedback_viewer_ecs_role_ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "feedback_viewer_ecs_role_ssm_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "feedback-viewer-ecs-role"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + feedback_viewer_ecs_role_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.feedback_viewer_ecs_role"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
